Revit 2026 API

# UIControlledApplicationProductIsRS Property

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool ProductIsRS { get; }
```
```vb
Public ReadOnly Property ProductIsRS As Boolean
	Get
```
```cpp
public:
property bool ProductIsRS {
	bool get ();
}
```
```fsharp
member ProductIsRS : bool with get
```

#### Property Value

Boolean

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace